tap "adoptopenjdk/openjdk"
tap "buo/cask-upgrade"
tap "danvergara/tools"
tap "go-task/tap"
tap "goreleaser/tap"
tap "graalvm/tap"
tap "hashicorp/tap"
tap "jcouball/tap"
tap "minio/stable"
tap "noahgorstein/tap"
tap "romkatv/powerlevel10k"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Distributed revision control system
brew "git"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# GNU binary tools for native development
brew "binutils"
# Parser generator
brew "bison"
# Collection of portable C++ source libraries
brew "boost"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Core application library for C
brew "glib"
# YAML Parser
brew "libyaml"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Command-line interface for SQLite
brew "sqlite"
# Prevent cloud misconfigurations during build-time for IaC tools
brew "checkov"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Database client every command-line junkie deserves
brew "dblab"
# Tool for exploring each layer in a docker image
brew "dive"
# Binary-decimal and decimal-binary routines for IEEE doubles
brew "double-conversion"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Fast Lexical Analyzer, generates Scanners (tokenizers)
brew "flex"
# Open-source formatting library for C++
brew "fmt"
# GNU database manager
brew "gdbm"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Library for processing command-line flags
brew "gflags"
# GitHub command-line tool
brew "gh"
# Small git utilities
brew "git-extras"
# Trim your git remote tracking branches that are merged or gone
brew "git-trim"
# Application-level logging library
brew "glog"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# X.509 and CMS library
brew "libksba"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Library access to GnuPG
brew "gpgme"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Improved top (interactive process viewer)
brew "htop"
# Regular expressions library
brew "oniguruma"
# Lightweight and flexible command-line JSON processor
brew "jq"
# TUI playground to experiment and play with jq
brew "jqp"
# Portable Foreign Function Interface library
brew "libffi"
# Postgres C API library
brew "libpq"
# Utility for directing compilation
brew "make"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# CLI for Node.js style checker and lint tool for Markdown files
brew "markdownlint-cli"
# Mac App Store command-line interface
brew "mas"
# High Performance, Kubernetes Native Object Storage
brew "minio"
# HTTP/2 C Library
brew "nghttp2"
# Development kit for the Java programming language
brew "openjdk"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Object-relational database system
brew "postgresql@17", restart_service: :changed
# Theme for zsh
brew "powerlevel10k"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Persistent key-value database, with built-in net interface
brew "redis"
# Work with remote images registries
brew "skopeo"
# Tool to impose load on and stress test a computer system
brew "stress"
# Upgrade all the things
brew "topgrade"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Syntax-aware linter for prose
brew "vale"
# Image processing library
brew "vips"
# Internet file retriever
brew "wget"
# Linter for YAML files
brew "yamllint"
# High-performance, asynchronous messaging library
brew "zeromq"
# General-purpose lossless data-compression library
brew "zlib"
# Task runner / simpler Make alternative written in Go
brew "go-task/tap/go-task"
# Terraform
brew "hashicorp/tap/terraform"
# A collection of personal command-line utilities by jcouball
brew "jcouball/tap/scripts"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Enable Windows-like alt-tab
cask "alt-tab"
# Tool to customise input devices and automate computer systems
cask "bettertouchtool"
# E-books management software
cask "calibre"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# Tool to show live information about the batteries in various devices
cask "coconutbattery"
# Disk space visualiser
cask "daisydisk"
# Voice and text chat software
cask "discord"
# Display control utility
cask "display-pilot"
# Monitor resolution and settings manager
cask "displays"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Window previews and controls
cask "dockmate"
cask "font-monaspace"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Release engineering, simplified
cask "goreleaser"
# Sheet music editor software for guitar, bass, keyboards, drums and more
cask "guitar-pro"
# Menu bar application that displays the CPU speed limit due to thermal issues
cask "hot"
# Automatically ejects external drives
cask "jettison"
# Display key code, unicode value and modifier keys state for any key combination
cask "key-codes"
# Detailed information on every Apple product ever made
cask "mactracker"
# Track and update to the latest versions of installed software
cask "macupdater"
# Tool for sending personal documents to Kindles from Macs
cask "send-to-kindle"
# Automatically checks computer's security
cask "silentknight"
# Checks EFI firmware and security data file updates
cask "silnite"
# Team communication and collaboration software
cask "slack"
# Control your Sonos system
cask "sonos"
# Sync and backup service to Synology NAS drives
cask "synology-drive"
# Configurable document editor that supports Markdown
cask "typora"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "Blackmagic Disk Speed Test", id: 425264550
mas "Clic", id: 6451395577
mas "Forecast Bar", id: 982710545
mas "iMovie", id: 408981434
mas "Kindle", id: 302584613
mas "PDFgear", id: 6469021132
mas "Pixelmator Pro", id: 1289583905
mas "Prime Video", id: 545519333
mas "Speedtest", id: 1153157709
mas "The Clock", id: 488764545
mas "The Unarchiver", id: 425424353
vscode "alexkrechik.cucumberautocomplete"
vscode "andrejunges.handlebars"
vscode "asciidoctor.asciidoctor-vscode"
vscode "bierner.markdown-mermaid"
vscode "chrischinchilla.vale-vscode"
vscode "ckolkman.vscode-postgres"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dlech.chmod"
vscode "dnut.rewrap-revived"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "earshinov.filter-lines"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "first-try-software.ruby-flog"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "howardzuo.vscode-npm-dependency"
vscode "koichisasada.vscode-rdbg"
vscode "leonidasiiv.google-sheets-equation-syntax-hightlighter"
vscode "marclipovsky.string-manipulation"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-server"
vscode "ninoseki.vscode-mogami"
vscode "orta.vscode-jest"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "shopify.ruby-lsp"
vscode "timonwong.shellcheck"
vscode "tyriar.sort-lines"
vscode "usernamehw.errorlens"
vscode "vscode-icons-team.vscode-icons"
vscode "yzhang.markdown-all-in-one"
